package com.example.demo;

public class Spring_1 {

	/*
	 * 비즈니스 로직이란 무엇인가
	 * 		ㄴ 사용자의 요구를 서비스 규칙에 맞게 처리하는 코드
	 * 
	 * Spring이란 무엇인가
	 * 		ㄴ 엔터프라이즈용 Java 애플리케이션 개발을 쉽고 편리하게 해주는 오픈소스 경량급 애플리케이션 프레임워크이다
	 * 			ㄴ 1. 앤터프라이즈 : Enterprise => 기업, 회사, 대규모 사업
	 * 					ㄴ 규모가 크고, 규칙이 복잡하고, 오래가야하는 시스템이라고 볼 수 있다.
	 * 			ㄴ 2. 애플리케이션 : 신청서, 지원서, 응용프로그램/앱, 적용/응용
	 * 					ㄴ 사용자가 어떠한 목적을 이루기 위해 쓰는 프로그램이다.
	 * 			ㄴ 3. 경량급 : 가벼운
	 * 					ㄴ 불가피하게 작성해야하는 복잡한 코드를 제거하여 코드의 복잡성을 낮췄다는 말이다.
	 * 			ㄴ 4. 프레임워크 : 애플리케이션의 기본 구조나 뼈대
	 * 
	 * Spring의 특징이란
	 * 			ㄴ 1. POJO 프로그래밍을 지향
	 * 					ㄴ POJO => Plain Old Java Object
	 * 							ㄴ 순수 Java만을 통해서 생성한 객체를 의미
	 * 					ㄴ PO : 순수
	 * 							ㄴ 제약이 없다.
	 * 					ㄴ JO : 자바 객체
	 * 							ㄴ 평범한 자바 객체이다.
	 * 					ㄴ POJO가 아닌건 다른 특정한 기술에 종속되는것
	 * 							ㄴ class MyClass extends HttpServlet{
	 * 
	 * 							  }
	 * 			ㄴ 2. IOC 
	 * 					ㄴ IOC : Inversion Of Control => 제어의 역전
	 * 							ㄴ 객체생성과 관리 권한을 개발자가 아닌 Spring이 가져간다.
	 * 					ㄴ 기존
	 * 							ㄴ 개발자가 객체를 만든다.
	 * 							ㄴ 개발자가 직접 연결한다.
	 * 							ㄴ 개발자가 직접 흐름을 제어한다.
	 * 					ㄴ 현재
	 * 							ㄴ Spring이 객체를 만든다.
	 * 							ㄴ Spring이 연결해준다.
	 * 							ㄴ 필요할 때만 내 코드를 호출한다.
	 * 					ㄴ 결론 : 제어권이 개발자 -> Spring 프레임워크로 이동
	 * 
	 * 			ㄴ 3. DI
	 * 					ㄴ DI : Dependency Injection => 의존성 주입
	 * 							ㄴ 필요한 객체를 직접 만들지 않고 받아서 쓴다.
	 * 					ㄴ 결합도가 낮아진다
	 * 							ㄴ 결합도란
	 * 					ㄴ 변경에 강하다
	 * 
	 * SpringBoot란 무엇인가
	 * 		ㄴ Spring을 설정없이 바로 쓰게 해주는 도구
	 * 
	 */
	
}
